Numpy Complete

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name": ['rudra', 'rohan', 'parthib', 'arnab'],
    "marks": [92, 95, 94, 93],
    "city": ['selmabad', 'kolkata', 'kharagpur', 'andul']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

      name  marks       city
0    rudra     92   selmabad
1    rohan     95    kolkata
2  parthib     94  kharagpur
3    arnab     93      andul

In [ ]:
df.to_csv('friends.csv')